# _Matrix Factorization Yöntemine Tavsiye Sistemleri_

In [1]:
import pandas as pd

# Veri manipülasyonu ve analiz için pandas kütüphanesini yüklüyoruz

In [2]:
ratings = pd.read_csv(
    'spark/spark/ml-100k/u.data', 
    sep='\t', 
    header=None, 
    names=['user_id', 'movie_id', 'rating'], 
    usecols=range(3)
)

# MovieLens veri setindeki kullanıcı-film puanlarını pandas DataFrame olarak okuyoruz

In [3]:
ratings

# DataFrame'i çağırarak kullanıcı-film puanlarını ve yapılarını görüntülüyoruz

        user_id  movie_id  rating
0             0        50       5
1             0       172       5
2             0       133       1
3           196       242       3
4           186       302       3
...         ...       ...     ...
99998       880       476       3
99999       716       204       5
100000      276      1090       1
100001       13       225       2
100002       12       203       3

[100003 rows x 3 columns]

In [4]:
movies = pd.read_csv(
    "spark/spark/ml-100k/u.item",
    encoding="iso-8859-1",
    sep="|",
    header=None,
    names=["movie_id", "title"],
    usecols=range(2)
)

# MovieLens veri setindeki film ID'leri ve isimlerini pandas DataFrame olarak okuyoruz

In [5]:
movies.head()

# DataFrame'in ilk 5 satırını görüntüleyerek film ID ve isimlerini hızlıca inceliyoruz

   movie_id              title
0         1   Toy Story (1995)
1         2   GoldenEye (1995)
2         3  Four Rooms (1995)
3         4  Get Shorty (1995)
4         5     Copycat (1995)

In [6]:
user = pd.read_csv(
    'spark/spark/ml-100k/u.user', 
    sep='|', 
    header=None, 
    names=['user_id', 'Age', 'Gender', 'Profession', 'Zipcode']
)

# MovieLens veri setindeki kullanıcı bilgilerini pandas DataFrame olarak okuyoruz

In [7]:
user.head()

# DataFrame'in ilk 5 satırını görüntüleyerek kullanıcı bilgilerini hızlıca inceliyoruz

   user_id  Age Gender  Profession Zipcode
0        1   24      M  technician   85711
1        2   53      F       other   94043
2        3   23      M      writer   32067
3        4   24      M  technician   43537
4        5   33      F       other   15213

In [8]:
rating = pd.merge(movies, ratings)

# Film isimleri ve kullanıcı puanlarını tek bir DataFrame'de birleştiriyoruz

In [9]:
rating.head()

# Birleştirilmiş DataFrame'in ilk 5 satırını görüntüleyerek kullanıcı-film-puan ilişkisini inceliyoruz

   movie_id             title  user_id  rating
0         1  Toy Story (1995)      308       4
1         1  Toy Story (1995)      287       5
2         1  Toy Story (1995)      148       4
3         1  Toy Story (1995)      280       4
4         1  Toy Story (1995)       66       3

In [10]:
# rating=pd.merge(rating,user)

In [11]:
# rating.head()

In [12]:
rating.title.value_counts()

# Her filmin kaç kez oy aldığını sayarak popülerliklerini kontrol ediyoruz

title
Star Wars (1977)                 584
Contact (1997)                   509
Fargo (1996)                     508
Return of the Jedi (1983)        507
Liar Liar (1997)                 485
                                ...
Someone Else's America (1995)      1
Dadetown (1995)                    1
He Walked by Night (1948)          1
Angela (1995)                      1
Hana-bi (1997)                     1
Name: count, Length: 1664, dtype: int64

In [14]:
mf = rating.pivot_table(index=['user_id'], columns=['title'], values='rating')

# Kullanıcıları satır, film isimlerini sütun olarak alıp puanları tabloya yerleştiriyoruz (pivot table oluşturuyoruz)

In [15]:
mf.head()

# Pivot tablonun ilk 5 satırını görüntüleyerek kullanıcı-film puan yapısını inceliyoruz

title,'Til There Was You (1997),1-900 (1994),101 Dalmatians (1996),12 Angry Men (1957),187 (1997),2 Days in the Valley (1996),"20,000 Leagues Under the Sea (1954)",2001: A Space Odyssey (1968),3 Ninjas: High Noon At Mega Mountain (1998),"39 Steps, The (1935)",...,Yankee Zulu (1994),Year of the Horse (1997),You So Crazy (1994),Young Frankenstein (1974),Young Guns (1988),Young Guns II (1990),"Young Poisoner's Handbook, The (1995)",Zeus and Roxanne (1997),unknown,Á köldum klaka (Cold Fever) (1994)
user_id,,,,,,,,,,,,,,,,,,,,,
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,2.0,5.0,NaN,NaN,3.0,4.0,NaN,NaN,...,NaN,NaN,NaN,5.0,3.0,NaN,NaN,NaN,4.0,NaN
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1.0,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,NaN,NaN,NaN,2.0,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [17]:
swr = mf['Star Wars (1977)']

# Pivot tablodan 'Star Wars (1977)' filminin tüm kullanıcılar için puanlarını seçiyoruz

In [18]:
swr.value_counts()

# 'Star Wars (1977)' filminin aldığı oyların dağılımını ve her puanın kaç kez verildiğini sayıyoruz

Star Wars (1977)
5.0    326
4.0    176
3.0     57
2.0     16
1.0      9
Name: count, dtype: int64

In [19]:
mf[['Star Wars (1977)', '101 Dalmatians (1996)']].corr()

# İki filmin kullanıcılar tarafından verilen puanları arasındaki Pearson korelasyonunu hesaplayarak benzerliklerini inceliyoruz

title                  Star Wars (1977)  101 Dalmatians (1996)
title
Star Wars (1977)               1.000000               0.211132
101 Dalmatians (1996)          0.211132               1.000000

In [ ]:
sm = mf.corrwith(swr)

# Tüm filmlerin 'Star Wars (1977)' ile kullanıcı puanları bazında korelasyonunu hesaplıyoruz

In [21]:
sm.sort_values(ascending=False)

# Bu satır, sm değişkenindeki değerleri büyükten küçüğe doğru sıralar.

title
Hollow Reed (1996)                         1.0
Man of the Year (1995)                     1.0
No Escape (1994)                           1.0
Commandments (1997)                        1.0
Cosi (1996)                                1.0
                                          ...
Wonderland (1997)                          NaN
Wooden Man's Bride, The (Wu Kui) (1994)    NaN
Yankee Zulu (1994)                         NaN
You So Crazy (1994)                        NaN
Á köldum klaka (Cold Fever) (1994)         NaN
Length: 1664, dtype: float64

In [22]:
import numpy as np

# NumPy kütüphanesini sayısal hesaplamalar ve dizi işlemleri için programa dahil eder.

In [23]:
mstats = rating.groupby('title').agg({'rating': [np.size, np.mean]})

# Her film başlığı için kaç tane puan verildiğini ve ortalama puanı hesaplar.

C:\Users\13tua\AppData\Local\Temp\ipykernel_8616\2271884876.py:1: FutureWarning: The provided callable <function mean at 0x0000019A5F0F74C0> is currently using SeriesGroupBy.mean. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "mean" instead.
  mstats=rating.groupby('title').agg({'rating':[np.size,np.mean]})

In [24]:
mstats.head()

# Oluşturulan istatistik tablosunun ilk 5 satırını görüntüler.

                          rating
                            size      mean
title
'Til There Was You (1997)      9  2.333333
1-900 (1994)                   5  2.600000
101 Dalmatians (1996)        109  2.908257
12 Angry Men (1957)          125  4.344000
187 (1997)                    41  3.024390

In [25]:
pm = mstats[mstats['rating']['size'] > 100]

# 100’den fazla oy alan filmleri seçerek daha güvenilir istatistikler elde eder.

In [26]:
smdata = pd.DataFrame(sm, columns=['similarity'])

# Benzerlik değerlerini 'similarity' adlı sütunla bir DataFrame yapısına dönüştürür.

In [27]:
smdata

# Oluşturulan DataFrame’in içeriğini ekrana yazdırır.

                                       similarity
title
'Til There Was You (1997)                0.872872
1-900 (1994)                            -0.645497
101 Dalmatians (1996)                    0.211132
12 Angry Men (1957)                      0.184289
187 (1997)                               0.027398
...                                           ...
Young Guns II (1990)                     0.228615
Young Poisoner's Handbook, The (1995)   -0.007374
Zeus and Roxanne (1997)                  0.818182
unknown                                  0.723123
Á köldum klaka (Cold Fever) (1994)            NaN

[1664 rows x 1 columns]

In [28]:
pm.columns = pm.columns.get_level_values(0)
df = pm.join(smdata)

# Çok seviyeli sütun yapısını sadeleştirir ve film istatistiklerini benzerlik verileriyle birleştirir.

In [ ]:
df.sort